src/cf/Enums/ВидыОперацийПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтКурьерскойКомпанииПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПродажиВалюты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРасходСоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежныеКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПродажиВКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРасходИзКассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходИзКассы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВКассуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПоступлениеВКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеВКассу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручкаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПродажиВалюты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЭкспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ФормыДокументовДеньгиКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура выполняет общий код команды документ основание надпись обработка навигационной ссылки
//
// Параметры:
//  Форма									 - Форма	 - Форма денежного документа
//  Элемент									 - ЭлементФормы	 - Элемент с гиперссылкой
//  НавигационнаяСсылкаФорматированнойСтроки - Строка	 - Вид навигационной ссылки
//  СтандартнаяОбработка					 - Булево	 - Стандартная обработка
//
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда
		
		Форма.Объект.ДокументОснование = Неопределено;
		Форма.Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Форма.Модифицированность = Истина;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "заполнить" Тогда
		
		ЗаполнитьПоОснованиюНачало(Форма);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "выбрать" Тогда
		
		// Выбрать основание
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", Форма);
		ДополнительныеПараметры = Новый Структура;
		Если ФормыДокументовДеньгиКлиентСервер.ЭтоПоступлениеВКассу(Форма) Тогда
			ДополнительныеПараметры.Вставить("НовыйМеханизмИнкассации", Форма.Объект.НовыйМеханизмИнкассации);
			ДополнительныеПараметры.Вставить("КассаККМ", Форма.Объект.КассаККМ);
		КонецЕсли;
		
		СписокОснований = ФормыДокументовДеньгиВызовСервера.ПолучитьСписокДляВыбораДокументаОснования(Форма.ИмяФормы, Форма.Объект.ВидОперации, ДополнительныеПараметры);
		
		Форма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокОснований, Элемент);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "открыть" Тогда
		
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоСсылке(Форма.Объект.ДокументОснование);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет общий код команды заполнить по основанию
//
// Параметры:
//  Форма	 - Форма	 - Форма денежного документа
//
Процедура ЗаполнитьПоОснованиюНачало(Форма) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", Форма);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ru = 'Заполнить документ по выбранному основанию?'"), 
		РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

// Процедура выполняет общий код команды шапка табличная часть
//
// Параметры:
//  Форма	 - Форма	 - Форма денежного документа
//
Процедура ШапкаТабличнаяЧасть(Форма) Экспорт
	
	Объект = Форма.Объект;
	ПараметрыДиалога = Новый Структура;
	ПараметрыФормы = Новый Структура;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты") Тогда
		
		ПараметрыФормы.Вставить("ПоложениеНастроекНалоговогоУчета", Объект.ПоложениеНастроекНалоговогоУчета);
		ПараметрыФормы.Вставить("ПоложениеЭквайринговогоТерминала", Объект.ПоложениеЭквайринговогоТерминала);
		ПараметрыФормы.Вставить("ДоговорЭквайринга", 				Форма.ДоговорЭквайринга);
		
	КонецЕсли;
	
	Если ФормыДокументовДеньгиКлиентСервер.ВидОперацииРасшифровкаСНалоговымУчетом(Объект.ВидОперации)
		И (Форма.ВидимостьУчитыватьВНУ ИЛИ Форма.ВидимостьПатент) Тогда 
		              
		ПараметрыФормы.Вставить("ПоложениеНастроекНалоговогоУчета", Объект.ПоложениеНастроекНалоговогоУчета);
		
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ПоложениеСтатьи", Объект.ПоложениеСтатьи);
	ПараметрыФормы.Вставить("ПоложениеПроекта", Объект.ПоложениеПроекта);
	ПараметрыФормы.Вставить("ПоложениеПодразделения", Объект.ПоложениеПодразделения);
	
	// Для данных видов операций пока не поддерживается переключение положения статьи
	Если    Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКредитам")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратПродажиВКредит")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Зарплата")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Зарплата")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога") Тогда
		
		ПараметрыФормы.Удалить("ПоложениеСтатьи");
		
	КонецЕсли;
	
	// Для данных видов операций пока не поддерживается переключение положения подразделения
	Если    Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.РасчетыПоКредитам")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ВозвратЗаймаСотрудником")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.РасчетыПоКредитам")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога") Тогда
		
		ПараметрыФормы.Удалить("ПоложениеПодразделения");
		ПараметрыФормы.Удалить("ПоложениеПроекта");
		
	КонецЕсли;
	
	ФормыДокументовДеньгиВызовСервера.ЗаполнитьПараметрыДиалогаШапкаТабличнаяЧасть(ПараметрыФормы, ПараметрыДиалога);
	
	ПараметрыДиалога.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	
	ОткрытьФорму(
	"ОбщаяФорма.ШапкаТабличнаяЧасть",
	ПараметрыДиалога,,,,,
	Новый ОписаниеОповещения("ШапкаТабличнаяЧастьЗавершение", Форма));
	
КонецПроцедуры

// Процедура выполняет общий код при изменении статьи в документе
//
// Параметры:
//  Форма	 - Форма	 - Форма денежного документа
//
Процедура СтатьяПриИзменении(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Статья) Тогда
		Объект.УчитыватьВНУ = ФормыДокументовДеньгиВызовСервера.СтатьяУчитываетсяВНУ(Объект.Статья, Объект.Организация, Объект.Дата, Объект.ВидОперации);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет общий код при изменении кассы в документе
//
// Параметры:
//  Форма	 - Форма	 - Форма денежного документа
//
Процедура КассаПриИзменении(Форма) Экспорт
	
	Объект = Форма.Объект;
	СтруктураДанных = ФормыДокументовДеньгиВызовСервера.ДанныеКассыПриИзменении(Объект.Касса);
	
	ПредыдущаяВалютаДС = Объект.ВалютаДенежныхСредств;
	
	Объект.ВалютаДенежныхСредств = ?(
		ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) И Не РасчетыРаботаСФормамиКлиент.ВсеСуммыРавныНулю(Форма),
		Объект.ВалютаДенежныхСредств,
		СтруктураДанных.ВалютаПоУмолчанию);
	
	Объект.ПодписьКассира = СтруктураДанных.ПодписьКассира;
	
КонецПроцедуры

// Процедура выполняет общий код при изменении документа планирования в документе
//
// Параметры:
//  Форма	 - Форма	 - Форма денежного документа
//  ИмяТЧ	 - Строка	 - Имя табличной части Расшифровка платежа
//
Процедура ДокументПланированияПриИзменении(Форма, ИмяТЧ) Экспорт
	
	ТекущиеДанные = Форма.Элементы[ИмяТЧ].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДокументПланирования) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВыплатаЗарплаты = ИмяТЧ = "ВыплатаЗаработнойПлаты";
	
	СтруктураДанных = ФормыДокументовДеньгиВызовСервера.ДанныеДокументаПланирования(
		ТекущиеДанные.ДокументПланирования, Форма.ВестиУчетОплатыПоСчетам,
		Форма.ВестиРасчетыПоДокументам Или ЭтоВыплатаЗарплаты);
	
	Если ЭтоВыплатаЗарплаты Тогда
		ИмяПоляДокумент = "Ведомость";
		СтруктураДанных.Вставить(ИмяПоляДокумент, СтруктураДанных.Документ);
	Иначе	
		ИмяПоляДокумент = "Документ";
	КонецЕсли;
	
	УстановитьЗначениеВСтрокуТекущиеДанные(ТекущиеДанные, СтруктураДанных, "СтатьяДДС");
	
	Если ЗначениеЗаполнено(СтруктураДанных.СчетНаОплату) И Не ЗначениеЗаполнено(ТекущиеДанные.СчетНаОплату) Тогда
		УстановитьЗначениеВСтрокуТекущиеДанные(ТекущиеДанные, СтруктураДанных, "СчетНаОплату");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных[ИмяПоляДокумент]) И Не ЗначениеЗаполнено(ТекущиеДанные[ИмяПоляДокумент]) Тогда
		УстановитьЗначениеВСтрокуТекущиеДанные(ТекущиеДанные, СтруктураДанных, ИмяПоляДокумент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.Подразделение) И Не ЗначениеЗаполнено(ТекущиеДанные.Подразделение) Тогда
		УстановитьЗначениеВСтрокуТекущиеДанные(ТекущиеДанные, СтруктураДанных, "Подразделение");
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму ФормаНастройкиНалоговогоУчета для нужной строки расшифровки платежа денежного документа
//
// Параметры:
//	Организация              - СправочникСсылка.Организации
//  ДанныеСтроки			 - ДанныеФормыЭлементКоллекции - данные строки табличной части
//  ИдентификаторСтроки		 - Число	 - идентификатор строки табличной части
//  ВидимостьУчитыватьВНУ	 - Булево
//  ВидимостьПатент			 - Булево
//  ОбработчикЗакрытия		 - ОписаниеОповещения	 - обработчик закрытия формы
//
Процедура ОткрытьФормуРедактированияНастроекНалоговогоУчетаПлатежа(Организация, ДанныеСтроки,
		ИдентификаторСтроки, ВидимостьУчитыватьВНУ, ВидимостьПатент, ОбработчикЗакрытия) Экспорт
	
	ПараметрыПодбора = Новый Структура("УчитыватьВНУ, НалогообложениеНДС, Патент");
	ЗаполнитьЗначенияСвойств(ПараметрыПодбора, ДанныеСтроки);
	ПараметрыПодбора.Вставить("ВидимостьУчитыватьВНУ",		 ВидимостьУчитыватьВНУ);
	ПараметрыПодбора.Вставить("ВидимостьНалогообложениеНДС", Ложь);
	ПараметрыПодбора.Вставить("ВидимостьПатент",			 ВидимостьПатент);
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, "НалогообложениеНДС")
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеСтроки.НалогообложениеНДС) Тогда
		ПараметрыПодбора.Вставить("НалогообложениеНДС", 	 ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС"));
	КонецЕсли;
	ПараметрыПодбора.Вставить("ИдентификаторСтроки",		 ИдентификаторСтроки);
	ПараметрыПодбора.Вставить("Организация",				 Организация);
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиНалоговогоУчета", ПараметрыПодбора, ЭтотОбъект, , , ,
		ОбработчикЗакрытия, ПредопределенноеЗначение("РежимОткрытияОкнаФормы.БлокироватьОкноВладельца"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьЗначениеВСтрокуТекущиеДанные(ТекущиеДанные, СтруктураДанных, ИмяСвойства)
	
	Если ТекущиеДанные.Свойство(ИмяСвойства) Тогда
		ТекущиеДанные[ИмяСвойства] = СтруктураДанных[ИмяСвойства];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
